[
  "## State and Lifecycle\n\nState is similar to props, but it is private and fully controlled by the component.\n\nState allows React components to respond to user input, server responses, and other changes without rewriting the entire component.\n\n### Using State Correctly\n\nDo not modify state directly. Instead, use setState().\n\n```js\nthis.setState({ count: this.state.count + 1 });\n\n---\n\n### State Updates and Re-rendering\n\nWhen state changes, React automatically re-renders the component and its childr",
  "omatically re-renders the component and its children.\nThis allows the UI to stay in sync with the underlying data without manual DOM updates.\n\nReact batches multiple state updates together for performance reasons.\nBecause of this, state updates may be asynchronous.\n\nTo correctly update state based on the previous value, use the functional form of setState:\n\n```js\nthis.setState(prevState => ({\n  count: prevState.count + 1\n}));\n\nQuick Start\nWelcome to the React documentation! This page will give y",
  " to the React documentation! This page will give you an introduction to 80% of the React concepts that you will use on a daily basis.\n\nYou will learn\nHow to create and nest components\nHow to add markup and styles\nHow to display data\nHow to render conditions and lists\nHow to respond to events and update the screen\nHow to share data between components\nCreating and nesting components \nReact apps are made out of components. A component is a piece of the UI (user interface) that has its own logic and",
  "the UI (user interface) that has its own logic and appearance. A component can be as small as a button, or as large as an entire page.\n\nReact components are JavaScript functions that return markup:\n\nfunction MyButton() {\n  return (\n    <button>I'm a button</button>\n  );\n}\nNow that you’ve declared MyButton, you can nest it into another component:\n\nexport default function MyApp() {\n  return (\n    <div>\n      <h1>Welcome to my app</h1>\n      <MyButton />\n    </div>\n  );\n}\nNotice that <MyButton /> s",
  "on />\n    </div>\n  );\n}\nNotice that <MyButton /> starts with a capital letter. That’s how you know it’s a React component. React component names must always start with a capital letter, while HTML tags must be lowercase.\n\nHave a look at the result:\n\nfunction MyButton() {\n  return (\n    <button>\n      I'm a button\n    </button>\n  );\n}\n\nexport default function MyApp() {\n  return (\n    <div>\n      <h1>Welcome to my app</h1>\n      <MyButton />\n    </div>\n  );\n}\n\n\n\nShow more\nThe export default keywor",
  "div>\n  );\n}\n\n\n\nShow more\nThe export default keywords specify the main component in the file. If you’re not familiar with some piece of JavaScript syntax, MDN and javascript.info have great references.\n\nWriting markup with JSX \nThe markup syntax you’ve seen above is called JSX. It is optional, but most React projects use JSX for its convenience. All of the tools we recommend for local development support JSX out of the box.\n\nJSX is stricter than HTML. You have to close tags like <br />. Your comp",
  "TML. You have to close tags like <br />. Your component also can’t return multiple JSX tags. You have to wrap them into a shared parent, like a <div>...</div> or an empty <>...</> wrapper:\n\nfunction AboutPage() {\n  return (\n    <>\n      <h1>About</h1>\n      <p>Hello there.<br />How do you do?</p>\n    </>\n  );\n}\nIf you have a lot of HTML to port to JSX, you can use an online converter.\n\nAdding styles \nIn React, you specify a CSS class with className. It works the same way as the HTML class attrib",
  "me. It works the same way as the HTML class attribute:\n\n<img className=\"avatar\" />\nThen you write the CSS rules for it in a separate CSS file:\n\n/* In your CSS */\n.avatar {\n  border-radius: 50%;\n}\nReact does not prescribe how you add CSS files. In the simplest case, you’ll add a <link> tag to your HTML. If you use a build tool or a framework, consult its documentation to learn how to add a CSS file to your project.\n\nDisplaying data \nJSX lets you put markup into JavaScript. Curly braces let you “e",
  "ut markup into JavaScript. Curly braces let you “escape back” into JavaScript so that you can embed some variable from your code and display it to the user. For example, this will display user.name:\n\nreturn (\n  <h1>\n    {user.name}\n  </h1>\n);\nYou can also “escape into JavaScript” from JSX attributes, but you have to use curly braces instead of quotes. For example, className=\"avatar\" passes the \"avatar\" string as the CSS class, but src={user.imageUrl} reads the JavaScript user.imageUrl variable v",
  "Url} reads the JavaScript user.imageUrl variable value, and then passes that value as the src attribute:\n\nreturn (\n  <img\n    className=\"avatar\"\n    src={user.imageUrl}\n  />\n);\nYou can put more complex expressions inside the JSX curly braces too, for example, string concatenation:\n\nconst user = {\n  name: 'Hedy Lamarr',\n  imageUrl: 'https://i.imgur.com/yXOvdOSs.jpg',\n  imageSize: 90,\n};\n\nexport default function Profile() {\n  return (\n    <>\n      <h1>{user.name}</h1>\n      <img\n        className=",
  "<h1>{user.name}</h1>\n      <img\n        className=\"avatar\"\n        src={user.imageUrl}\n        alt={'Photo of ' + user.name}\n        style={{\n          width: user.imageSize,\n          height: user.imageSize\n        }}\n      />\n    </>\n  );\n}\n\nIn the above example, style={{}} is not a special syntax, but a regular {} object inside the style={ } JSX curly braces. You can use the style attribute when your styles depend on JavaScript variables.\n\nConditional rendering \nIn React, there is no special ",
  "ditional rendering \nIn React, there is no special syntax for writing conditions. Instead, you’ll use the same techniques as you use when writing regular JavaScript code. For example, you can use an if statement to conditionally include JSX:\n\nlet content;\nif (isLoggedIn) {\n  content = <AdminPanel />;\n} else {\n  content = <LoginForm />;\n}\nreturn (\n  <div>\n    {content}\n  </div>\n);\nIf you prefer more compact code, you can use the conditional ? operator. Unlike if, it works inside JSX:\n\n<div>\n  {isL",
  "tor. Unlike if, it works inside JSX:\n\n<div>\n  {isLoggedIn ? (\n    <AdminPanel />\n  ) : (\n    <LoginForm />\n  )}\n</div>\nWhen you don’t need the else branch, you can also use a shorter logical && syntax:\n\n<div>\n  {isLoggedIn && <AdminPanel />}\n</div>\nAll of these approaches also work for conditionally specifying attributes. If you’re unfamiliar with some of this JavaScript syntax, you can start by always using if...else.\n\nRendering lists \nYou will rely on JavaScript features like for loop and the ",
  "rely on JavaScript features like for loop and the array map() function to render lists of components.\n\nFor example, let’s say you have an array of products:\n\nconst products = [\n  { title: 'Cabbage', id: 1 },\n  { title: 'Garlic', id: 2 },\n  { title: 'Apple', id: 3 },\n];\nInside your component, use the map() function to transform an array of products into an array of <li> items:\n\nconst listItems = products.map(product =>\n  <li key={product.id}>\n    {product.title}\n  </li>\n);\n\nreturn (\n  <ul>{listIt",
  "{product.title}\n  </li>\n);\n\nreturn (\n  <ul>{listItems}</ul>\n);\nNotice how <li> has a key attribute. For each item in a list, you should pass a string or a number that uniquely identifies that item among its siblings. Usually, a key should be coming from your data, such as a database ID. React uses your keys to know what happened if you later insert, delete, or reorder the items.\n\nconst products = [\n  { title: 'Cabbage', isFruit: false, id: 1 },\n  { title: 'Garlic', isFruit: false, id: 2 },\n  { t",
  " { title: 'Garlic', isFruit: false, id: 2 },\n  { title: 'Apple', isFruit: true, id: 3 },\n];\n\nexport default function ShoppingList() {\n  const listItems = products.map(product =>\n    <li\n      key={product.id}\n      style={{\n        color: product.isFruit ? 'magenta' : 'darkgreen'\n      }}\n    >\n      {product.title}\n    </li>\n  );\n\n  return (\n    <ul>{listItems}</ul>\n  );\n}\n\nResponding to events \nYou can respond to events by declaring event handler functions inside your components:\n\nfunction MyB",
  "er functions inside your components:\n\nfunction MyButton() {\n  function handleClick() {\n    alert('You clicked me!');\n  }\n\n  return (\n    <button onClick={handleClick}>\n      Click me\n    </button>\n  );\n}\nNotice how onClick={handleClick} has no parentheses at the end! Do not call the event handler function: you only need to pass it down. React will call your event handler when the user clicks the button.\n\nUpdating the screen \nOften, you’ll want your component to “remember” some information and di",
  "ur component to “remember” some information and display it. For example, maybe you want to count the number of times a button is clicked. To do this, add state to your component.\n\nFirst, import useState from React:\n\nimport { useState } from 'react';\nNow you can declare a state variable inside your component:\n\nfunction MyButton() {\n  const [count, setCount] = useState(0);\n  // ...\nYou’ll get two things from useState: the current state (count), and the function that lets you update it (setCount). ",
  " the function that lets you update it (setCount). You can give them any names, but the convention is to write [something, setSomething].\n\nThe first time the button is displayed, count will be 0 because you passed 0 to useState(). When you want to change state, call setCount() and pass the new value to it. Clicking this button will increment the counter:\n\nfunction MyButton() {\n  const [count, setCount] = useState(0);\n\n  function handleClick() {\n    setCount(count + 1);\n  }\n\n  return (\n    <button",
  "  setCount(count + 1);\n  }\n\n  return (\n    <button onClick={handleClick}>\n      Clicked {count} times\n    </button>\n  );\n}\nReact will call your component function again. This time, count will be 1. Then it will be 2. And so on.\n\nIf you render the same component multiple times, each will get its own state. Click each button separately:\n\nimport { useState } from 'react';\n\nexport default function MyApp() {\n  return (\n    <div>\n      <h1>Counters that update separately</h1>\n      <MyButton />\n      ",
  "t update separately</h1>\n      <MyButton />\n      <MyButton />\n    </div>\n  );\n}\n\nfunction MyButton() {\n  const [count, setCount] = useState(0);\n\n  function handleClick() {\n    setCount(count + 1);\n  }\n\n  return (\n    <button onClick={handleClick}>\n      Clicked {count} times\n    </button>\n  );\n}\n\n\n\nNotice how each button “remembers” its own count state and doesn’t affect other buttons.\n\nUsing Hooks \nFunctions starting with use are called Hooks. useState is a built-in Hook provided by React. You",
  "useState is a built-in Hook provided by React. You can find other built-in Hooks in the API reference. You can also write your own Hooks by combining the existing ones.\n\nHooks are more restrictive than other functions. You can only call Hooks at the top of your components (or other Hooks). If you want to use useState in a condition or a loop, extract a new component and put it there.\n\nSharing data between components \nIn the previous example, each MyButton had its own independent count, and when ",
  " MyButton had its own independent count, and when each button was clicked, only the count for the button clicked changed:\n\nDiagram showing a tree of three components, one parent labeled MyApp and two children labeled MyButton. Both MyButton components contain a count with value zero.\nInitially, each MyButton’s count state is 0\n\nThe same diagram as the previous, with the count of the first child MyButton component highlighted indicating a click with the count value incremented to one. The second ",
  "th the count value incremented to one. The second MyButton component still contains value zero.\nThe first MyButton updates its count to 1\n\nHowever, often you’ll need components to share data and always update together.\n\nTo make both MyButton components display the same count and update together, you need to move the state from the individual buttons “upwards” to the closest component containing all of them.\n\nIn this example, it is MyApp:\n\nDiagram showing a tree of three components, one parent la",
  " showing a tree of three components, one parent labeled MyApp and two children labeled MyButton. MyApp contains a count value of zero which is passed down to both of the MyButton components, which also show value zero.\nInitially, MyApp’s count state is 0 and is passed down to both children\n\nThe same diagram as the previous, with the count of the parent MyApp component highlighted indicating a click with the value incremented to one. The flow to both of the children MyButton components is also hi",
  "oth of the children MyButton components is also highlighted, and the count value in each child is set to one indicating the value was passed down.\nOn click, MyApp updates its count state to 1 and passes it down to both children\n\nNow when you click either button, the count in MyApp will change, which will change both of the counts in MyButton. Here’s how you can express this in code.\n\nFirst, move the state up from MyButton into MyApp:\n\nexport default function MyApp() {\n  const [count, setCount] =",
  "ult function MyApp() {\n  const [count, setCount] = useState(0);\n\n  function handleClick() {\n    setCount(count + 1);\n  }\n\n  return (\n    <div>\n      <h1>Counters that update separately</h1>\n      <MyButton />\n      <MyButton />\n    </div>\n  );\n}\n\nfunction MyButton() {\n  // ... we're moving code from here ...\n}\nThen, pass the state down from MyApp to each MyButton, together with the shared click handler. You can pass information to MyButton using the JSX curly braces, just like you previously did",
  "the JSX curly braces, just like you previously did with built-in tags like <img>:\n\nexport default function MyApp() {\n  const [count, setCount] = useState(0);\n\n  function handleClick() {\n    setCount(count + 1);\n  }\n\n  return (\n    <div>\n      <h1>Counters that update together</h1>\n      <MyButton count={count} onClick={handleClick} />\n      <MyButton count={count} onClick={handleClick} />\n    </div>\n  );\n}\nThe information you pass down like this is called props. Now the MyApp component contains ",
  "is called props. Now the MyApp component contains the count state and the handleClick event handler, and passes both of them down as props to each of the buttons.\n\nFinally, change MyButton to read the props you have passed from its parent component:\n\nfunction MyButton({ count, onClick }) {\n  return (\n    <button onClick={onClick}>\n      Clicked {count} times\n    </button>\n  );\n}\nWhen you click the button, the onClick handler fires. Each button’s onClick prop was set to the handleClick function i",
  "onClick prop was set to the handleClick function inside MyApp, so the code inside of it runs. That code calls setCount(count + 1), incrementing the count state variable. The new count value is passed as a prop to each button, so they all show the new value. This is called “lifting state up”. By moving state up, you’ve shared it between components.\n\n\nimport { useState } from 'react';\n\nexport default function MyApp() {\n  const [count, setCount] = useState(0);\n\n  function handleClick() {\n    setCou",
  "seState(0);\n\n  function handleClick() {\n    setCount(count + 1);\n  }\n\n  return (\n    <div>\n      <h1>Counters that update together</h1>\n      <MyButton count={count} onClick={handleClick} />\n      <MyButton count={count} onClick={handleClick} />\n    </div>\n  );\n}\n\nfunction MyButton({ count, onClick }) {\n  return (\n    <button onClick={onClick}>\n      Clicked {count} times\n    </button>\n  );\n}\n\nNext Steps \nBy now, you know the basics of how to write React code!\n\nCheck out the Tutorial to put them",
  "te React code!\n\nCheck out the Tutorial to put them into practice and build your first mini-app with React.\n\nNext\nTutorial: Tic-Tac-Toe",
  "our First Component\nComponents are one of the core concepts of React. They are the foundation upon which you build user interfaces (UI), which makes them the perfect place to start your React journey!\n\nYou will learn\nWhat a component is\nWhat role components play in a React application\nHow to write your first React component\nComponents: UI building blocks \nOn the Web, HTML lets us create rich structured documents with its built-in set of tags like <h1> and <li>:\n\n<article>\n  <h1>My First Componen",
  " <h1> and <li>:\n\n<article>\n  <h1>My First Component</h1>\n  <ol>\n    <li>Components: UI Building Blocks</li>\n    <li>Defining a Component</li>\n    <li>Using a Component</li>\n  </ol>\n</article>\nThis markup represents this article <article>, its heading <h1>, and an (abbreviated) table of contents as an ordered list <ol>. Markup like this, combined with CSS for style, and JavaScript for interactivity, lies behind every sidebar, avatar, modal, dropdown—every piece of UI you see on the Web.\n\nReact le",
  "wn—every piece of UI you see on the Web.\n\nReact lets you combine your markup, CSS, and JavaScript into custom “components”, reusable UI elements for your app. The table of contents code you saw above could be turned into a <TableOfContents /> component you could render on every page. Under the hood, it still uses the same HTML tags like <article>, <h1>, etc.\n\nJust like with HTML tags, you can compose, order and nest components to design whole pages. For example, the documentation page you’re rea",
  "es. For example, the documentation page you’re reading is made out of React components:\n\n<PageLayout>\n  <NavigationHeader>\n    <SearchBar />\n    <Link to=\"/docs\">Docs</Link>\n  </NavigationHeader>\n  <Sidebar />\n  <PageContent>\n    <TableOfContents />\n    <DocumentationText />\n  </PageContent>\n</PageLayout>\nAs your project grows, you will notice that many of your designs can be composed by reusing components you already wrote, speeding up your development. Our table of contents above could be adde",
  "lopment. Our table of contents above could be added to any screen with <TableOfContents />! You can even jumpstart your project with the thousands of components shared by the React open source community like Chakra UI and Material UI.\n\nDefining a component \nTraditionally when creating web pages, web developers marked up their content and then added interaction by sprinkling on some JavaScript. This worked great when interaction was a nice-to-have on the web. Now it is expected for many sites and",
  " on the web. Now it is expected for many sites and all apps. React puts interactivity first while still using the same technology: a React component is a JavaScript function that you can sprinkle with markup. Here’s what that looks like (you can edit the example below):\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\nexport default function Profile() {\n  return (\n    <img\n      src=\"https://i.imgur.com/MK3eW3Am.jpg\"\n      alt=\"Katherine Johnson\"\n    />\n  )\n}\n\n\nAnd here’s how to build a ",
  "Johnson\"\n    />\n  )\n}\n\n\nAnd here’s how to build a component:\n\nStep 1: Export the component \nThe export default prefix is a standard JavaScript syntax (not specific to React). It lets you mark the main function in a file so that you can later import it from other files. (More on importing in Importing and Exporting Components!)\n\nStep 2: Define the function \nWith function Profile() { } you define a JavaScript function with the name Profile.\n\nPitfall\nReact components are regular JavaScript function",
  "l\nReact components are regular JavaScript functions, but their names must start with a capital letter or they won’t work!\n\nStep 3: Add markup \nThe component returns an <img /> tag with src and alt attributes. <img /> is written like HTML, but it is actually JavaScript under the hood! This syntax is called JSX, and it lets you embed markup inside JavaScript.\n\nReturn statements can be written all on one line, as in this component:\n\nreturn <img src=\"https://i.imgur.com/MK3eW3As.jpg\" alt=\"Katherine ",
  "\"https://i.imgur.com/MK3eW3As.jpg\" alt=\"Katherine Johnson\" />;\nBut if your markup isn’t all on the same line as the return keyword, you must wrap it in a pair of parentheses:\n\nreturn (\n  <div>\n    <img src=\"https://i.imgur.com/MK3eW3As.jpg\" alt=\"Katherine Johnson\" />\n  </div>\n);\nPitfall\nWithout parentheses, any code on the lines after return will be ignored!\n\nUsing a component \nNow that you’ve defined your Profile component, you can nest it inside other components. For example, you can export a ",
  "e other components. For example, you can export a Gallery component that uses multiple Profile components:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\nfunction Profile() {\n  return (\n    <img\n      src=\"https://i.imgur.com/MK3eW3As.jpg\"\n      alt=\"Katherine Johnson\"\n    />\n  );\n}\n\nexport default function Gallery() {\n  return (\n    <section>\n      <h1>Amazing scientists</h1>\n      <Profile />\n      <Profile />\n      <Profile />\n    </section>\n  );\n}\n\n",
  "ofile />\n      <Profile />\n    </section>\n  );\n}\n\n\n\nShow more\nWhat the browser sees \nNotice the difference in casing:\n\n<section> is lowercase, so React knows we refer to an HTML tag.\n<Profile /> starts with a capital P, so React knows that we want to use our component called Profile.\nAnd Profile contains even more HTML: <img />. In the end, this is what the browser sees:\n\n<section>\n  <h1>Amazing scientists</h1>\n  <img src=\"https://i.imgur.com/MK3eW3As.jpg\" alt=\"Katherine Johnson\" />\n  <img src=\"",
  "eW3As.jpg\" alt=\"Katherine Johnson\" />\n  <img src=\"https://i.imgur.com/MK3eW3As.jpg\" alt=\"Katherine Johnson\" />\n  <img src=\"https://i.imgur.com/MK3eW3As.jpg\" alt=\"Katherine Johnson\" />\n</section>\nNesting and organizing components \nComponents are regular JavaScript functions, so you can keep multiple components in the same file. This is convenient when components are relatively small or tightly related to each other. If this file gets crowded, you can always move Profile to a separate file. You wi",
  "can always move Profile to a separate file. You will learn how to do this shortly on the page about imports.\n\nBecause the Profile components are rendered inside Gallery—even several times!—we can say that Gallery is a parent component, rendering each Profile as a “child”. This is part of the magic of React: you can define a component once, and then use it in as many places and as many times as you like.\n\nPitfall\nComponents can render other components, but you must never nest their definitions:\n\n",
  "ents, but you must never nest their definitions:\n\nexport default function Gallery() {\n  // 🔴 Never define a component inside another component!\n  function Profile() {\n    // ...\n  }\n  // ...\n}\nThe snippet above is very slow and causes bugs. Instead, define every component at the top level:\n\nexport default function Gallery() {\n  // ...\n}\n\n// ✅ Declare components at the top level\nfunction Profile() {\n  // ...\n}\nWhen a child component needs some data from a parent, pass it by props instead of nesti",
  "a from a parent, pass it by props instead of nesting definitions.\n\nDeep Dive\nComponents all the way down \n\nShow Details\nRecap\nYou’ve just gotten your first taste of React! Let’s recap some key points.\n\nReact lets you create components, reusable UI elements for your app.\n\nIn a React app, every piece of UI is a component.\n\nReact components are regular JavaScript functions except:\n\nTheir names always begin with a capital letter.\nThey return JSX markup.\nTry out some challenges\n1. Export the componen",
  "up.\nTry out some challenges\n1. Export the component\n2. Fix the return statement\n3. Spot the mistake\n4. Your own component\n\n\nChallenge 1 of 4: Export the component \nThis sandbox doesn’t work because the root component is not exported:\n\n\nApp.js\nDownload\n\nReload\n\nClear\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\nfunction Profile() {\n  return (\n    <img\n      src=\"https://i.imgur.com/lICfvbD.jpg\"\n      alt=\"Aklilu Lemma\"\n    />\n  );\n}\n\n\nError\nElement type is invalid: expected a string (for built-in components) or a clas",
  "ected a string (for built-in components) or a class/function (for composite components) but got: object. You likely forgot to export your component from the file it's defined in, or you might have mixed up default and named imports.\nTry to fix it yourself before looking at the solution!\n\nShow solution\n\nImporting and Exporting Components\nThe magic of components lies in their reusability: you can create components that are composed of other components. But as you nest more and more components, it ",
  "nts. But as you nest more and more components, it often makes sense to start splitting them into different files. This lets you keep your files easy to scan and reuse components in more places.\n\nYou will learn\nWhat a root component file is\nHow to import and export a component\nWhen to use default and named imports and exports\nHow to import and export multiple components from one file\nHow to split components into multiple files\nThe root component file \nIn Your First Component, you made a Profile c",
  "ile \nIn Your First Component, you made a Profile component and a Gallery component that renders it:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\nfunction Profile() {\n  return (\n    <img\n      src=\"https://i.imgur.com/MK3eW3As.jpg\"\n      alt=\"Katherine Johnson\"\n    />\n  );\n}\n\nexport default function Gallery() {\n  return (\n    <section>\n      <h1>Amazing scientists</h1>\n      <Profile />\n      <Profile />\n      <Profile />\n    </section>\n  );\n}\n\n\n\nShow ",
  ">\n      <Profile />\n    </section>\n  );\n}\n\n\n\nShow more\nThese currently live in a root component file, named App.js in this example. Depending on your setup, your root component could be in another file, though. If you use a framework with file-based routing, such as Next.js, your root component will be different for every page.\n\nExporting and importing a component \nWhat if you want to change the landing screen in the future and put a list of science books there? Or place all the profiles somewhe",
  "nce books there? Or place all the profiles somewhere else? It makes sense to move Gallery and Profile out of the root component file. This will make them more modular and reusable in other files. You can move a component in three steps:\n\nMake a new JS file to put the components in.\nExport your function component from that file (using either default or named exports).\nImport it in the file where you’ll use the component (using the corresponding technique for importing default or named exports).\nH",
  "chnique for importing default or named exports).\nHere both Profile and Gallery have been moved out of App.js into a new file called Gallery.js. Now you can change App.js to import Gallery from Gallery.js:\n\nApp.js\nGallery.js\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\nimport Gallery from './Gallery.js';\n\nexport default function App() {\n  return (\n    <Gallery />\n  );\n}\n\n\nNotice how this example is broken down into two component files now:\n\nGallery.js:\nDefines the Profile component which is only used wit",
  "fines the Profile component which is only used within the same file and is not exported.\nExports the Gallery component as a default export.\nApp.js:\nImports Gallery as a default import from Gallery.js.\nExports the root App component as a default export.\nNote\nYou may encounter files that leave off the .js file extension like so:\n\nimport Gallery from './Gallery';\nEither './Gallery.js' or './Gallery' will work with React, though the former is closer to how native ES Modules work.\n\nDeep Dive\nDefault ",
  "to how native ES Modules work.\n\nDeep Dive\nDefault vs named exports \n\nShow Details\nExporting and importing multiple components from the same file \nWhat if you want to show just one Profile instead of a gallery? You can export the Profile component, too. But Gallery.js already has a default export, and you can’t have two default exports. You could create a new file with a default export, or you could add a named export for Profile. A file can only have one default export, but it can have numerous ",
  "have one default export, but it can have numerous named exports!\n\nNote\nTo reduce the potential confusion between default and named exports, some teams choose to only stick to one style (default or named), or avoid mixing them in a single file. Do what works best for you!\n\nFirst, export Profile from Gallery.js using a named export (no default keyword):\n\nexport function Profile() {\n  // ...\n}\nThen, import Profile from Gallery.js to App.js using a named import (with the curly braces):\n\nimport { Pro",
  "amed import (with the curly braces):\n\nimport { Profile } from './Gallery.js';\nFinally, render <Profile /> from the App component:\n\nexport default function App() {\n  return <Profile />;\n}\nNow Gallery.js contains two exports: a default Gallery export, and a named Profile export. App.js imports both of them. Try editing <Profile /> to <Gallery /> and back in this example:\n\nApp.js\nGallery.js\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\nimport Gallery from './Gallery.js';\nimport { Profile } from './Gallery",
  "'./Gallery.js';\nimport { Profile } from './Gallery.js';\n\nexport default function App() {\n  return (\n    <Profile />\n  );\n}\n\n\nNow you’re using a mix of default and named exports:\n\nGallery.js:\nExports the Profile component as a named export called Profile.\nExports the Gallery component as a default export.\nApp.js:\nImports Profile as a named import called Profile from Gallery.js.\nImports Gallery as a default import from Gallery.js.\nExports the root App component as a default export.\nRecap\nOn this p",
  "App component as a default export.\nRecap\nOn this page you learned:\n\nWhat a root component file is\nHow to import and export a component\nWhen and how to use default and named imports and exports\nHow to export multiple components from the same file\nTry out some challenges\nChallenge 1 of 1: Split the components further \nCurrently, Gallery.js exports both Profile and Gallery, which is a bit confusing.\n\nMove the Profile component to its own Profile.js, and then change the App component to render both ",
  " and then change the App component to render both <Profile /> and <Gallery /> one after another.\n\nYou may use either a default or a named export for Profile, but make sure that you use the corresponding import syntax in both App.js and Gallery.js! You can refer to the table from the deep dive above:\n\nSyntax\tExport statement\tImport statement\nDefault\texport default function Button() {}\timport Button from './Button.js';\nNamed\texport function Button() {}\timport { Button } from './Button.js';\nApp.js\n",
  ") {}\timport { Button } from './Button.js';\nApp.js\nGallery.js\nProfile.js\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n// Move me to Profile.js!\nexport function Profile() {\n  return (\n    <img\n      src=\"https://i.imgur.com/QIrZWGIs.jpg\"\n      alt=\"Alan L. Hart\"\n    />\n  );\n}\n\nexport default function Gallery() {\n  return (\n    <section>\n      <h1>Amazing scientists</h1>\n      <Profile />\n      <Profile />\n      <Profile />\n    </section>\n  );\n}\n\n\n\nShow more\nAfter you ",
  "e />\n    </section>\n  );\n}\n\n\n\nShow more\nAfter you get it working with one kind of exports, make it work with the other kind.\n\nShow hintShow solution\nPrevious\nYour First Component\nNext\nWriting Markup with JSX\nCopyright © Meta Platforms, Inc\nuwu?\nLearn React\nQuick Start\nInstallation\nDescribing the UI\nAdding Interactivity\nManaging State\nEscape Hatches\n\nLearn React\nDescribing the UI\nWriting Markup with JSX\nJSX is a syntax extension for JavaScript that lets you write HTML-like markup inside a JavaScr",
  "t lets you write HTML-like markup inside a JavaScript file. Although there are other ways to write components, most React developers prefer the conciseness of JSX, and most codebases use it.\n\nYou will learn\nWhy React mixes markup with rendering logic\nHow JSX is different from HTML\nHow to display information with JSX\nJSX: Putting markup into JavaScript \nThe Web has been built on HTML, CSS, and JavaScript. For many years, web developers kept content in HTML, design in CSS, and logic in JavaScript—",
  "t in HTML, design in CSS, and logic in JavaScript—often in separate files! Content was marked up inside HTML while the page’s logic lived separately in JavaScript:\n\nHTML markup with purple background and a div with two child tags: p and form. \nHTML\n\nThree JavaScript handlers with yellow background: onSubmit, onLogin, and onClick.\nJavaScript\n\nBut as the Web became more interactive, logic increasingly determined content. JavaScript was in charge of the HTML! This is why in React, rendering logic a",
  " the HTML! This is why in React, rendering logic and markup live together in the same place—components.\n\nReact component with HTML and JavaScript from previous examples mixed. Function name is Sidebar which calls the function isLoggedIn, highlighted in yellow. Nested inside the function highlighted in purple is the p tag from before, and a Form tag referencing the component shown in the next diagram.\nSidebar.js React component\n\nReact component with HTML and JavaScript from previous examples mixe",
  "th HTML and JavaScript from previous examples mixed. Function name is Form containing two handlers onClick and onSubmit highlighted in yellow. Following the handlers is HTML highlighted in purple. The HTML contains a form element with a nested input element, each with an onClick prop.\nForm.js React component\n\nKeeping a button’s rendering logic and markup together ensures that they stay in sync with each other on every edit. Conversely, details that are unrelated, such as the button’s markup and ",
  "at are unrelated, such as the button’s markup and a sidebar’s markup, are isolated from each other, making it safer to change either of them on their own.\n\nEach React component is a JavaScript function that may contain some markup that React renders into the browser. React components use a syntax extension called JSX to represent that markup. JSX looks a lot like HTML, but it is a bit stricter and can display dynamic information. The best way to understand this is to convert some HTML markup to ",
  "understand this is to convert some HTML markup to JSX markup.\n\nNote\nJSX and React are two separate things. They’re often used together, but you can use them independently of each other. JSX is a syntax extension, while React is a JavaScript library.\n\nConverting HTML to JSX \nSuppose that you have some (perfectly valid) HTML:\n\n<h1>Hedy Lamarr's Todos</h1>\n<img \n  src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n  alt=\"Hedy Lamarr\" \n  class=\"photo\"\n>\n<ul>\n    <li>Invent new traffic lights\n    <li>Rehearse a",
  "  <li>Invent new traffic lights\n    <li>Rehearse a movie scene\n    <li>Improve the spectrum technology\n</ul>\nAnd you want to put it into your component:\n\nexport default function TodoList() {\n  return (\n    // ???\n  )\n}\nIf you copy and paste it as is, it will not work:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\nexport default function TodoList() {\n  return (\n    // This doesn't quite work!\n    <h1>Hedy Lamarr's Todos</h1>\n    <img \n      src=\"https://i.imgur.",
  "s Todos</h1>\n    <img \n      src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n      alt=\"Hedy Lamarr\" \n      class=\"photo\"\n    >\n    <ul>\n      <li>Invent new traffic lights\n      <li>Rehearse a movie scene\n      <li>Improve the spectrum technology\n    </ul>\n  );\n}\n\n\nError\n/src/App.js: Adjacent JSX elements must be wrapped in an enclosing tag. Did you want a JSX fragment <>...</>? (5:4)\n\n  3 |     // This doesn't quite work!\n  4 |     <h1>Hedy Lamarr's Todos</h1>\n> 5 |     <img \n    |     ^\n  6 |       s",
  "dos</h1>\n> 5 |     <img \n    |     ^\n  6 |       src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n  7 |       alt=\"Hedy Lamarr\" \n  8 |       class=\"photo\"\n\nShow more\nThis is because JSX is stricter and has a few more rules than HTML! If you read the error messages above, they’ll guide you to fix the markup, or you can follow the guide below.\n\nNote\nMost of the time, React’s on-screen error messages will help you find where the problem is. Give them a read if you get stuck!\n\nThe Rules of JSX \n1. Return a s",
  "if you get stuck!\n\nThe Rules of JSX \n1. Return a single root element \nTo return multiple elements from a component, wrap them with a single parent tag.\n\nFor example, you can use a <div>:\n\n<div>\n  <h1>Hedy Lamarr's Todos</h1>\n  <img \n    src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n    alt=\"Hedy Lamarr\" \n    class=\"photo\"\n  >\n  <ul>\n    ...\n  </ul>\n</div>\nIf you don’t want to add an extra <div> to your markup, you can write <> and </> instead:\n\n<>\n  <h1>Hedy Lamarr's Todos</h1>\n  <img \n    src=\"https:",
  "1>Hedy Lamarr's Todos</h1>\n  <img \n    src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n    alt=\"Hedy Lamarr\" \n    class=\"photo\"\n  >\n  <ul>\n    ...\n  </ul>\n</>\nThis empty tag is called a Fragment. Fragments let you group things without leaving any trace in the browser HTML tree.\n\nDeep Dive\nWhy do multiple JSX tags need to be wrapped? \n\nShow Details\n2. Close all the tags \nJSX requires tags to be explicitly closed: self-closing tags like <img> must become <img />, and wrapping tags like <li>oranges must be",
  "img />, and wrapping tags like <li>oranges must be written as <li>oranges</li>.\n\nThis is how Hedy Lamarr’s image and list items look closed:\n\n<>\n  <img \n    src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n    alt=\"Hedy Lamarr\" \n    class=\"photo\"\n   />\n  <ul>\n    <li>Invent new traffic lights</li>\n    <li>Rehearse a movie scene</li>\n    <li>Improve the spectrum technology</li>\n  </ul>\n</>\n3. camelCase all most of the things! \nJSX turns into JavaScript and attributes written in JSX become keys of JavaScri",
  " attributes written in JSX become keys of JavaScript objects. In your own components, you will often want to read those attributes into variables. But JavaScript has limitations on variable names. For example, their names can’t contain dashes or be reserved words like class.\n\nThis is why, in React, many HTML and SVG attributes are written in camelCase. For example, instead of stroke-width you use strokeWidth. Since class is a reserved word, in React you write className instead, named after the c",
  "act you write className instead, named after the corresponding DOM property:\n\n<img \n  src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n  alt=\"Hedy Lamarr\" \n  className=\"photo\"\n/>\nYou can find all these attributes in the list of DOM component props. If you get one wrong, don’t worry—React will print a message with a possible correction to the browser console.\n\nPitfall\nFor historical reasons, aria-* and data-* attributes are written as in HTML with dashes.\n\nPro-tip: Use a JSX Converter \nConverting all thes",
  "\nPro-tip: Use a JSX Converter \nConverting all these attributes in existing markup can be tedious! We recommend using a converter to translate your existing HTML and SVG to JSX. Converters are very useful in practice, but it’s still worth understanding what is going on so that you can comfortably write JSX on your own.\n\nHere is your final result:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\nexport default function TodoList() {\n  return (\n    <>\n      <h1>Hed",
  "ction TodoList() {\n  return (\n    <>\n      <h1>Hedy Lamarr's Todos</h1>\n      <img \n        src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n        alt=\"Hedy Lamarr\" \n        className=\"photo\" \n      />\n      <ul>\n        <li>Invent new traffic lights</li>\n        <li>Rehearse a movie scene</li>\n        <li>Improve the spectrum technology</li>\n      </ul>\n    </>\n  );\n}\n\n\n\nShow more\nRecap\nNow you know why JSX exists and how to use it in components:\n\nReact components group rendering logic together with m",
  "t components group rendering logic together with markup because they are related.\nJSX is similar to HTML, with a few differences. You can use a converter if you need to.\nError messages will often point you in the right direction to fixing your markup.\nTry out some challenges\nChallenge 1 of 1: Convert some HTML to JSX \nThis HTML was pasted into a component, but it’s not valid JSX. Fix it:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\nexport default function Bio() {\n  return",
  "\n11\n12\n13\nexport default function Bio() {\n  return (\n    <div class=\"intro\">\n      <h1>Welcome to my website!</h1>\n    </div>\n    <p class=\"summary\">\n      You can find my thoughts here.\n      <br><br>\n      <b>And <i>pictures</b></i> of scientists!\n    </p>\n  );\n}\n\n\nWhether to do it by hand or using the converter is up to you!\n\nShow solution\nPrevious\nImporting and Exporting Components\nNext\nJavaScript in JSX with Curly Braces\nCopyright © Meta Platforms, Inc\nuwu?\nLearn React\nQuick Start\nInstallat",
  "tforms, Inc\nuwu?\nLearn React\nQuick Start\nInstallation\nDescribing the UI\nAdding Interactivity\nManaging State\nEscape Hatches\nAPI Reference\nReact APIs\nReact DOM APIs\nLearn React\nDescribing the UI\nWriting Markup with JSX\nJSX is a syntax extension for JavaScript that lets you write HTML-like markup inside a JavaScript file. Although there are other ways to write components, most React developers prefer the conciseness of JSX, and most codebases use it.\n\nYou will learn\nWhy React mixes markup with rend",
  ".\n\nYou will learn\nWhy React mixes markup with rendering logic\nHow JSX is different from HTML\nHow to display information with JSX\nJSX: Putting markup into JavaScript \nThe Web has been built on HTML, CSS, and JavaScript. For many years, web developers kept content in HTML, design in CSS, and logic in JavaScript—often in separate files! Content was marked up inside HTML while the page’s logic lived separately in JavaScript:\n\nHTML markup with purple background and a div with two child tags: p and fo",
  "background and a div with two child tags: p and form. \nHTML\n\nThree JavaScript handlers with yellow background: onSubmit, onLogin, and onClick.\nJavaScript\n\nBut as the Web became more interactive, logic increasingly determined content. JavaScript was in charge of the HTML! This is why in React, rendering logic and markup live together in the same place—components.\n\nReact component with HTML and JavaScript from previous examples mixed. Function name is Sidebar which calls the function isLoggedIn, h",
  " is Sidebar which calls the function isLoggedIn, highlighted in yellow. Nested inside the function highlighted in purple is the p tag from before, and a Form tag referencing the component shown in the next diagram.\nSidebar.js React component\n\nReact component with HTML and JavaScript from previous examples mixed. Function name is Form containing two handlers onClick and onSubmit highlighted in yellow. Following the handlers is HTML highlighted in purple. The HTML contains a form element with a ne",
  "purple. The HTML contains a form element with a nested input element, each with an onClick prop.\nForm.js React component\n\nKeeping a button’s rendering logic and markup together ensures that they stay in sync with each other on every edit. Conversely, details that are unrelated, such as the button’s markup and a sidebar’s markup, are isolated from each other, making it safer to change either of them on their own.\n\nEach React component is a JavaScript function that may contain some markup that Rea",
  "ipt function that may contain some markup that React renders into the browser. React components use a syntax extension called JSX to represent that markup. JSX looks a lot like HTML, but it is a bit stricter and can display dynamic information. The best way to understand this is to convert some HTML markup to JSX markup.\n\nNote\nJSX and React are two separate things. They’re often used together, but you can use them independently of each other. JSX is a syntax extension, while React is a JavaScrip",
  " is a syntax extension, while React is a JavaScript library.\n\nConverting HTML to JSX \nSuppose that you have some (perfectly valid) HTML:\n\n<h1>Hedy Lamarr's Todos</h1>\n<img \n  src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n  alt=\"Hedy Lamarr\" \n  class=\"photo\"\n>\n<ul>\n    <li>Invent new traffic lights\n    <li>Rehearse a movie scene\n    <li>Improve the spectrum technology\n</ul>\nAnd you want to put it into your component:\n\nexport default function TodoList() {\n  return (\n    // ???\n  )\n}\nIf you copy and past",
  "{\n  return (\n    // ???\n  )\n}\nIf you copy and paste it as is, it will not work:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\nexport default function TodoList() {\n  return (\n    // This doesn't quite work!\n    <h1>Hedy Lamarr's Todos</h1>\n    <img \n      src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n      alt=\"Hedy Lamarr\" \n      class=\"photo\"\n    >\n    <ul>\n      <li>Invent new traffic lights\n      <li>Rehearse a movie scene\n      <li>Improve the spectrum technology",
  "ie scene\n      <li>Improve the spectrum technology\n    </ul>\n  );\n}\n\n\nError\n/src/App.js: Adjacent JSX elements must be wrapped in an enclosing tag. Did you want a JSX fragment <>...</>? (5:4)\n\n  3 |     // This doesn't quite work!\n  4 |     <h1>Hedy Lamarr's Todos</h1>\n> 5 |     <img \n    |     ^\n  6 |       src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n  7 |       alt=\"Hedy Lamarr\" \n  8 |       class=\"photo\"\n\nShow more\nThis is because JSX is stricter and has a few more rules than HTML! If you read th",
  "and has a few more rules than HTML! If you read the error messages above, they’ll guide you to fix the markup, or you can follow the guide below.\n\nNote\nMost of the time, React’s on-screen error messages will help you find where the problem is. Give them a read if you get stuck!\n\nThe Rules of JSX \n1. Return a single root element \nTo return multiple elements from a component, wrap them with a single parent tag.\n\nFor example, you can use a <div>:\n\n<div>\n  <h1>Hedy Lamarr's Todos</h1>\n  <img \n    sr",
  "div>\n  <h1>Hedy Lamarr's Todos</h1>\n  <img \n    src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n    alt=\"Hedy Lamarr\" \n    class=\"photo\"\n  >\n  <ul>\n    ...\n  </ul>\n</div>\nIf you don’t want to add an extra <div> to your markup, you can write <> and </> instead:\n\n<>\n  <h1>Hedy Lamarr's Todos</h1>\n  <img \n    src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n    alt=\"Hedy Lamarr\" \n    class=\"photo\"\n  >\n  <ul>\n    ...\n  </ul>\n</>\nThis empty tag is called a Fragment. Fragments let you group things without leaving any ",
  "ragments let you group things without leaving any trace in the browser HTML tree.\n\nDeep Dive\nWhy do multiple JSX tags need to be wrapped? \n\nShow Details\n2. Close all the tags \nJSX requires tags to be explicitly closed: self-closing tags like <img> must become <img />, and wrapping tags like <li>oranges must be written as <li>oranges</li>.\n\nThis is how Hedy Lamarr’s image and list items look closed:\n\n<>\n  <img \n    src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n    alt=\"Hedy Lamarr\" \n    class=\"photo\"\n ",
  "s.jpg\" \n    alt=\"Hedy Lamarr\" \n    class=\"photo\"\n   />\n  <ul>\n    <li>Invent new traffic lights</li>\n    <li>Rehearse a movie scene</li>\n    <li>Improve the spectrum technology</li>\n  </ul>\n</>\n3. camelCase all most of the things! \nJSX turns into JavaScript and attributes written in JSX become keys of JavaScript objects. In your own components, you will often want to read those attributes into variables. But JavaScript has limitations on variable names. For example, their names can’t contain das",
  " names. For example, their names can’t contain dashes or be reserved words like class.\n\nThis is why, in React, many HTML and SVG attributes are written in camelCase. For example, instead of stroke-width you use strokeWidth. Since class is a reserved word, in React you write className instead, named after the corresponding DOM property:\n\n<img \n  src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n  alt=\"Hedy Lamarr\" \n  className=\"photo\"\n/>\nYou can find all these attributes in the list of DOM component props.",
  "ese attributes in the list of DOM component props. If you get one wrong, don’t worry—React will print a message with a possible correction to the browser console.\n\nPitfall\nFor historical reasons, aria-* and data-* attributes are written as in HTML with dashes.\n\nPro-tip: Use a JSX Converter \nConverting all these attributes in existing markup can be tedious! We recommend using a converter to translate your existing HTML and SVG to JSX. Converters are very useful in practice, but it’s still worth u",
  "re very useful in practice, but it’s still worth understanding what is going on so that you can comfortably write JSX on your own.\n\nHere is your final result:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\nexport default function TodoList() {\n  return (\n    <>\n      <h1>Hedy Lamarr's Todos</h1>\n      <img \n        src=\"https://i.imgur.com/yXOvdOSs.jpg\" \n        alt=\"Hedy Lamarr\" \n        className=\"photo\" \n      />\n      <ul>\n        <li>Invent new traffic li",
  "   />\n      <ul>\n        <li>Invent new traffic lights</li>\n        <li>Rehearse a movie scene</li>\n        <li>Improve the spectrum technology</li>\n      </ul>\n    </>\n  );\n}\n\n\n\nShow more\nRecap\nNow you know why JSX exists and how to use it in components:\n\nReact components group rendering logic together with markup because they are related.\nJSX is similar to HTML, with a few differences. You can use a converter if you need to.\nError messages will often point you in the right direction to fixing ",
  " often point you in the right direction to fixing your markup.\nTry out some challenges\nChallenge 1 of 1: Convert some HTML to JSX \nThis HTML was pasted into a component, but it’s not valid JSX. Fix it:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\nexport default function Bio() {\n  return (\n    <div class=\"intro\">\n      <h1>Welcome to my website!</h1>\n    </div>\n    <p class=\"summary\">\n      You can find my thoughts here.\n      <br><br>\n      <b>And <i>pictures</b></i> of s",
  "    <br><br>\n      <b>And <i>pictures</b></i> of scientists!\n    </p>\n  );\n}\n\n\nWhether to do it by hand or using the converter is up to you!\n\nShow solution\nPrevious\nImporting and Exporting Components\nNext\nJavaScript in JSX with Curly Braces\nCopyright © Meta Platforms, Inc\nuwu?\nLearn React\nQuick Start\nInstallation\nDescribing the UI\nAdding Interactivity\nManaging State\nEscape Hatches\nAPI Reference\nReact APIs\nReact DOM APIs\nLearn React\nDescribing the UI\nPassing Props to a Component\nReact components ",
  " UI\nPassing Props to a Component\nReact components use props to communicate with each other. Every parent component can pass some information to its child components by giving them props. Props might remind you of HTML attributes, but you can pass any JavaScript value through them, including objects, arrays, and functions.\n\nYou will learn\nHow to pass props to a component\nHow to read props from a component\nHow to specify default values for props\nHow to pass some JSX to a component\nHow props change",
  "w to pass some JSX to a component\nHow props change over time\nFamiliar props \nProps are the information that you pass to a JSX tag. For example, className, src, alt, width, and height are some of the props you can pass to an <img>:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\nfunction Avatar() {\n  return (\n    <img\n      className=\"avatar\"\n      src=\"https://i.imgur.com/1bX5QH6.jpg\"\n      alt=\"Lin Lanying\"\n      width={100}\n      height={100}\n    />\n  );\n}\n\n",
  "    width={100}\n      height={100}\n    />\n  );\n}\n\nexport default function Profile() {\n  return (\n    <Avatar />\n  );\n}\n\n\n\nShow more\nThe props you can pass to an <img> tag are predefined (ReactDOM conforms to the HTML standard). But you can pass any props to your own components, such as <Avatar>, to customize them. Here’s how!\n\nPassing props to a component \nIn this code, the Profile component isn’t passing any props to its child component, Avatar:\n\nexport default function Profile() {\n  return (\n ",
  "\n\nexport default function Profile() {\n  return (\n    <Avatar />\n  );\n}\nYou can give Avatar some props in two steps.\n\nStep 1: Pass props to the child component \nFirst, pass some props to Avatar. For example, let’s pass two props: person (an object), and size (a number):\n\nexport default function Profile() {\n  return (\n    <Avatar\n      person={{ name: 'Lin Lanying', imageId: '1bX5QH6' }}\n      size={100}\n    />\n  );\n}\nNote\nIf double curly braces after person= confuse you, recall they’re merely an ",
  "ter person= confuse you, recall they’re merely an object inside the JSX curlies.\n\nNow you can read these props inside the Avatar component.\n\nStep 2: Read props inside the child component \nYou can read these props by listing their names person, size separated by the commas inside ({ and }) directly after function Avatar. This lets you use them inside the Avatar code, like you would with a variable.\n\nfunction Avatar({ person, size }) {\n  // person and size are available here\n}\nAdd some logic to Av",
  "and size are available here\n}\nAdd some logic to Avatar that uses the person and size props for rendering, and you’re done.\n\nNow you can configure Avatar to render in many different ways with different props. Try tweaking the values!\n\nApp.js\nutils.js\n\nReload\n\nClear\n\nFork\nimport { getImageUrl } from './utils.js';\n\nfunction Avatar({ person, size }) {\n  return (\n    <img\n      className=\"avatar\"\n      src={getImageUrl(person)}\n      alt={person.name}\n      width={size}\n      height={size}\n    />\n  )",
  "\n      width={size}\n      height={size}\n    />\n  );\n}\n\nexport default function Profile() {\n  return (\n    <div>\n      <Avatar\n        size={100}\n        person={{ \n          name: 'Katsuko Saruhashi', \n          imageId: 'YfeOqp2'\n        }}\n      />\n      <Avatar\n        size={80}\n        person={{\n          name: 'Aklilu Lemma', \n          imageId: 'OKS67lh'\n        }}\n      />\n      <Avatar\n        size={50}\n        person={{ \n          name: 'Lin Lanying',\n          imageId: '1bX5QH6'\n      ",
  "'Lin Lanying',\n          imageId: '1bX5QH6'\n        }}\n      />\n    </div>\n  );\n}\n\n\n\nShow more\nProps let you think about parent and child components independently. For example, you can change the person or the size props inside Profile without having to think about how Avatar uses them. Similarly, you can change how the Avatar uses these props, without looking at the Profile.\n\nYou can think of props like “knobs” that you can adjust. They serve the same role as arguments serve for functions—in fa",
  "e same role as arguments serve for functions—in fact, props are the only argument to your component! React component functions accept a single argument, a props object:\n\nfunction Avatar(props) {\n  let person = props.person;\n  let size = props.size;\n  // ...\n}\nUsually you don’t need the whole props object itself, so you destructure it into individual props.\n\nPitfall\nDon’t miss the pair of { and } curlies inside of ( and ) when declaring props:\n\nfunction Avatar({ person, size }) {\n  // ...\n}\nThis ",
  "nction Avatar({ person, size }) {\n  // ...\n}\nThis syntax is called “destructuring” and is equivalent to reading properties from a function parameter:\n\nfunction Avatar(props) {\n  let person = props.person;\n  let size = props.size;\n  // ...\n}\nSpecifying a default value for a prop \nIf you want to give a prop a default value to fall back on when no value is specified, you can do it with the destructuring by putting = and the default value right after the parameter:\n\nfunction Avatar({ person, size = ",
  " the parameter:\n\nfunction Avatar({ person, size = 100 }) {\n  // ...\n}\nNow, if <Avatar person={...} /> is rendered with no size prop, the size will be set to 100.\n\nThe default value is only used if the size prop is missing or if you pass size={undefined}. But if you pass size={null} or size={0}, the default value will not be used.\n\nForwarding props with the JSX spread syntax \nSometimes, passing props gets very repetitive:\n\nfunction Profile({ person, size, isSepia, thickBorder }) {\n  return (\n    ",
  "n, size, isSepia, thickBorder }) {\n  return (\n    <div className=\"card\">\n      <Avatar\n        person={person}\n        size={size}\n        isSepia={isSepia}\n        thickBorder={thickBorder}\n      />\n    </div>\n  );\n}\nThere’s nothing wrong with repetitive code—it can be more legible. But at times you may value conciseness. Some components forward all of their props to their children, like how this Profile does with Avatar. Because they don’t use any of their props directly, it can make sense to ",
  "any of their props directly, it can make sense to use a more concise “spread” syntax:\n\nfunction Profile(props) {\n  return (\n    <div className=\"card\">\n      <Avatar {...props} />\n    </div>\n  );\n}\nThis forwards all of Profile’s props to the Avatar without listing each of their names.\n\nUse spread syntax with restraint. If you’re using it in every other component, something is wrong. Often, it indicates that you should split your components and pass children as JSX. More on that next!\n\nPassing JSX",
  "s children as JSX. More on that next!\n\nPassing JSX as children \nIt is common to nest built-in browser tags:\n\n<div>\n  <img />\n</div>\nSometimes you’ll want to nest your own components the same way:\n\n<Card>\n  <Avatar />\n</Card>\nWhen you nest content inside a JSX tag, the parent component will receive that content in a prop called children. For example, the Card component below will receive a children prop set to <Avatar /> and render it in a wrapper div:\n\nApp.js\nAvatar.js\nutils.js\n\nReload\n\nClear\n\nF",
  " div:\n\nApp.js\nAvatar.js\nutils.js\n\nReload\n\nClear\n\nFork\nimport Avatar from './Avatar.js';\n\nfunction Card({ children }) {\n  return (\n    <div className=\"card\">\n      {children}\n    </div>\n  );\n}\n\nexport default function Profile() {\n  return (\n    <Card>\n      <Avatar\n        size={100}\n        person={{ \n          name: 'Katsuko Saruhashi',\n          imageId: 'YfeOqp2'\n        }}\n      />\n    </Card>\n  );\n}\n\n\n\nShow more\nTry replacing the <Avatar> inside <Card> with some text to see how the Card com",
  "side <Card> with some text to see how the Card component can wrap any nested content. It doesn’t need to “know” what’s being rendered inside of it. You will see this flexible pattern in many places.\n\nYou can think of a component with a children prop as having a “hole” that can be “filled in” by its parent components with arbitrary JSX. You will often use the children prop for visual wrappers: panels, grids, etc.\n\nA puzzle-like Card tile with a slot for \"children\" pieces like text and Avatar\nIllu",
  "ot for \"children\" pieces like text and Avatar\nIllustrated by Rachel Lee Nabors\nHow props change over time \nThe Clock component below receives two props from its parent component: color and time. (The parent component’s code is omitted because it uses state, which we won’t dive into just yet.)\n\nTry changing the color in the select box below:\n\n\nClock.js\n\nReload\n\nClear\n\nFork\nexport default function Clock({ color, time }) {\n  return (\n    <h1 style={{ color: color }}>\n      {time}\n    </h1>\n  );\n}\n\n",
  "{ color: color }}>\n      {time}\n    </h1>\n  );\n}\n\n\nThis example illustrates that a component may receive different props over time. Props are not always static! Here, the time prop changes every second, and the color prop changes when you select another color. Props reflect a component’s data at any point in time, rather than only in the beginning.\n\nHowever, props are immutable—a term from computer science meaning “unchangeable”. When a component needs to change its props (for example, in respon",
  " needs to change its props (for example, in response to a user interaction or new data), it will have to “ask” its parent component to pass it different props—a new object! Its old props will then be cast aside, and eventually the JavaScript engine will reclaim the memory taken by them.\n\nDon’t try to “change props”. When you need to respond to the user input (like changing the selected color), you will need to “set state”, which you can learn about in State: A Component’s Memory.\n\nRecap\nTo pass ",
  "ut in State: A Component’s Memory.\n\nRecap\nTo pass props, add them to the JSX, just like you would with HTML attributes.\nTo read props, use the function Avatar({ person, size }) destructuring syntax.\nYou can specify a default value like size = 100, which is used for missing and undefined props.\nYou can forward all props with <Avatar {...props} /> JSX spread syntax, but don’t overuse it!\nNested JSX like <Card><Avatar /></Card> will appear as Card component’s children prop.\nProps are read-only snap",
  "omponent’s children prop.\nProps are read-only snapshots in time: every render receives a new version of props.\nYou can’t change props. When you need interactivity, you’ll need to set state.\nTry out some challenges\n1. Extract a component\n2. Adjust the image size based on a prop\n3. Passing JSX in a children prop\n\n\nChallenge 1 of 3: Extract a component \nThis Gallery component contains some very similar markup for two profiles. Extract a Profile component out of it to reduce the duplication. You’ll ",
  "onent out of it to reduce the duplication. You’ll need to choose what props to pass to it.\n\nApp.js\nutils.js\n\nReload\n\nClear\n\nFork\nimport { getImageUrl } from './utils.js';\n\nexport default function Gallery() {\n  return (\n    <div>\n      <h1>Notable Scientists</h1>\n      <section className=\"profile\">\n        <h2>Maria Skłodowska-Curie</h2>\n        <img\n          className=\"avatar\"\n          src={getImageUrl('szV5sdG')}\n          alt=\"Maria Skłodowska-Curie\"\n          width={70}\n          height={70",
  "a-Curie\"\n          width={70}\n          height={70}\n        />\n        <ul>\n          <li>\n            <b>Profession: </b> \n            physicist and chemist\n          </li>\n          <li>\n            <b>Awards: 4 </b> \n            (Nobel Prize in Physics, Nobel Prize in Chemistry, Davy Medal, Matteucci Medal)\n          </li>\n          <li>\n            <b>Discovered: </b>\n            polonium (chemical element)\n          </li>\n        </ul>\n      </section>\n      <section className=\"profile\">\n  ",
  " </section>\n      <section className=\"profile\">\n        <h2>Katsuko Saruhashi</h2>\n        <img\n          className=\"avatar\"\n          src={getImageUrl('YfeOqp2')}\n          alt=\"Katsuko Saruhashi\"\n          width={70}\n          height={70}\n        />\n        <ul>\n          <li>\n            <b>Profession: </b> \n            geochemist\n          </li>\n          <li>\n            <b>Awards: 2 </b> \n            (Miyake Prize for geochemistry, Tanaka Prize)\n          </li>\n          <li>\n            <",
  "rize)\n          </li>\n          <li>\n            <b>Discovered: </b>\n            a method for measuring carbon dioxide in seawater\n          </li>\n        </ul>\n      </section>\n    </div>\n  );\n}\n\n\n\nShow more\nShow hintShow solution\nNext Challenge\nPrevious\nJavaScript in JSX with Curly Braces\nNext\nConditional Rendering\nCopyright © Meta Platforms, Inc\nuwu?\nLearn React\nQuick Start\nInstallation\nDescribing the UI\nAdding Interactivity\nManaging State\nEscape Hatches\nAPI Reference\nReact APIs\nReact DOM API",
  "ape Hatches\nAPI Reference\nReact APIs\nReact DOM APIs\nLearn React\nDescribing the UI\nConditional Rendering\nYour components will often need to display different things depending on different conditions. In React, you can conditionally render JSX using JavaScript syntax like if statements, &&, and ? : operators.\n\nYou will learn\nHow to return different JSX depending on a condition\nHow to conditionally include or exclude a piece of JSX\nCommon conditional syntax shortcuts you’ll encounter in React codeb",
  "l syntax shortcuts you’ll encounter in React codebases\nConditionally returning JSX \nLet’s say you have a PackingList component rendering several Items, which can be marked as packed or not:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\nfunction Item({ name, isPacked }) {\n  return <li className=\"item\">{name}</li>;\n}\n\nexport default function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n   ",
  " <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nNotice that some of the Item components have their isPacked prop set to true instead of false. You want to add a checkmark (✅) to packed items",
  "e. You want to add a checkmark (✅) to packed items if isPacked={true}.\n\nYou can write this as an if/else statement like so:\n\nif (isPacked) {\n  return <li className=\"item\">{name} ✅</li>;\n}\nreturn <li className=\"item\">{name}</li>;\nIf the isPacked prop is true, this code returns a different JSX tree. With this change, some of the items get a checkmark at the end:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPacked }) {\n  if (isPacked) {\n    return <li className=\"item\">{name} ✅</li",
  "ed) {\n    return <li className=\"item\">{name} ✅</li>;\n  }\n  return <li className=\"item\">{name}</li>;\n}\n\nexport default function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    ",
  "  name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nTry editing what gets returned in either case, and see how the result changes!\n\nNotice how you’re creating branching logic with JavaScript’s if and return statements. In React, control flow (like conditions) is handled by JavaScript.\n\nConditionally returning nothing with null \nIn some situations, you won’t want to render anything at all. For example, say you don’t want to show packed items at all. A component must r",
  "nt to show packed items at all. A component must return something. In this case, you can return null:\n\nif (isPacked) {\n  return null;\n}\nreturn <li className=\"item\">{name}</li>;\nIf isPacked is true, the component will return nothing, null. Otherwise, it will return JSX to render.\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPacked }) {\n  if (isPacked) {\n    return null;\n  }\n  return <li className=\"item\">{name}</li>;\n}\n\nexport default function PackingList() {\n  return (\n    <sect",
  "ault function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nIn practice, returning null from a component isn’t common because it might surpris",
  " a component isn’t common because it might surprise a developer trying to render it. More often, you would conditionally include or exclude the component in the parent component’s JSX. Here’s how to do that!\n\nConditionally including JSX \nIn the previous example, you controlled which (if any!) JSX tree would be returned by the component. You may already have noticed some duplication in the render output:\n\n<li className=\"item\">{name} ✅</li>\nis very similar to\n\n<li className=\"item\">{name}</li>\nBoth",
  " similar to\n\n<li className=\"item\">{name}</li>\nBoth of the conditional branches return <li className=\"item\">...</li>:\n\nif (isPacked) {\n  return <li className=\"item\">{name} ✅</li>;\n}\nreturn <li className=\"item\">{name}</li>;\nWhile this duplication isn’t harmful, it could make your code harder to maintain. What if you want to change the className? You’d have to do it in two places in your code! In such a situation, you could conditionally include a little JSX to make your code more DRY.\n\nConditional",
  "ittle JSX to make your code more DRY.\n\nConditional (ternary) operator (? :) \nJavaScript has a compact syntax for writing a conditional expression — the conditional operator or “ternary operator”.\n\nInstead of this:\n\nif (isPacked) {\n  return <li className=\"item\">{name} ✅</li>;\n}\nreturn <li className=\"item\">{name}</li>;\nYou can write this:\n\nreturn (\n  <li className=\"item\">\n    {isPacked ? name + ' ✅' : name}\n  </li>\n);\nYou can read it as “if isPacked is true, then (?) render name + ' ✅', otherwise ",
  "d is true, then (?) render name + ' ✅', otherwise (:) render name”.\n\nDeep Dive\nAre these two examples fully equivalent? \n\nShow Details\nNow let’s say you want to wrap the completed item’s text into another HTML tag, like <del> to strike it out. You can add even more newlines and parentheses so that it’s easier to nest more JSX in each of the cases:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPacked }) {\n  return (\n    <li className=\"item\">\n      {isPacked ? (\n        <del>\n    ",
  "ame=\"item\">\n      {isPacked ? (\n        <del>\n          {name + ' ✅'}\n        </del>\n      ) : (\n        name\n      )}\n    </li>\n  );\n}\n\nexport default function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of",
  "        isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nThis style works well for simple conditions, but use it in moderation. If your components get messy with too much nested conditional markup, consider extracting child components to clean things up. In React, markup is a part of your code, so you can use tools like variables and functions to tidy up complex expressions.\n\nLogical AND operator (&&) \nAnother common shortcut you’ll encou",
  "perator (&&) \nAnother common shortcut you’ll encounter is the JavaScript logical AND (&&) operator. Inside React components, it often comes up when you want to render some JSX when the condition is true, or render nothing otherwise. With &&, you could conditionally render the checkmark only if isPacked is true:\n\nreturn (\n  <li className=\"item\">\n    {name} {isPacked && '✅'}\n  </li>\n);\nYou can read this as “if isPacked, then (&&) render the checkmark, otherwise, render nothing”.\n\nHere it is in act",
  "rk, otherwise, render nothing”.\n\nHere it is in action:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPacked }) {\n  return (\n    <li className=\"item\">\n      {name} {isPacked && '✅'}\n    </li>\n  );\n}\n\nexport default function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" ",
  "true} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nA JavaScript && expression returns the value of its right side (in our case, the checkmark) if the left side (our condition) is true. But if the condition is false, the whole expression becomes false. React considers false as a “hole” in the JSX tree, just like null or undefined, and doesn’t render anythi",
  " like null or undefined, and doesn’t render anything in its place.\n\nPitfall\nDon’t put numbers on the left side of &&.\n\nTo test the condition, JavaScript converts the left side to a boolean automatically. However, if the left side is 0, then the whole expression gets that value (0), and React will happily render 0 rather than nothing.\n\nFor example, a common mistake is to write code like messageCount && <p>New messages</p>. It’s easy to assume that it renders nothing when messageCount is 0, but it",
  " it renders nothing when messageCount is 0, but it really renders the 0 itself!\n\nTo fix it, make the left side a boolean: messageCount > 0 && <p>New messages</p>.\n\nConditionally assigning JSX to a variable \nWhen the shortcuts get in the way of writing plain code, try using an if statement and a variable. You can reassign variables defined with let, so start by providing the default content you want to display, the name:\n\nlet itemContent = name;\nUse an if statement to reassign a JSX expression to",
  "se an if statement to reassign a JSX expression to itemContent if isPacked is true:\n\nif (isPacked) {\n  itemContent = name + \" ✅\";\n}\nCurly braces open the “window into JavaScript”. Embed the variable with curly braces in the returned JSX tree, nesting the previously calculated expression inside of JSX:\n\n<li className=\"item\">\n  {itemContent}\n</li>\nThis style is the most verbose, but it’s also the most flexible. Here it is in action:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPa",
  "ad\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPacked }) {\n  let itemContent = name;\n  if (isPacked) {\n    itemContent = name + \" ✅\";\n  }\n  return (\n    <li className=\"item\">\n      {itemContent}\n    </li>\n  );\n}\n\nexport default function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" \n ",
  "ue} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nLike before, this works not only for text, but for arbitrary JSX too:\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPacked }) {\n  let itemContent = name;\n  if (isPacked) {\n    itemContent = (\n      <del>\n        {name + \" ✅\"}\n      </del>\n    );\n  }\n  return (\n    <li className=\"item\">\n    ",
  "  );\n  }\n  return (\n    <li className=\"item\">\n      {itemContent}\n    </li>\n  );\n}\n\nexport default function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n",
  "m\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nIf you’re not familiar with JavaScript, this variety of styles might seem overwhelming at first. However, learning them will help you read and write any JavaScript code — and not just React components! Pick the one you prefer for a start, and then consult this reference again if you forget how the other ones work.\n\nRecap\nIn React, you control branching logic with JavaScript.\nYou can return a JSX expression conditionally with an if sta",
  "turn a JSX expression conditionally with an if statement.\nYou can conditionally save some JSX to a variable and then include it inside other JSX by using the curly braces.\nIn JSX, {cond ? <A /> : <B />} means “if cond, render <A />, otherwise <B />”.\nIn JSX, {cond && <A />} means “if cond, render <A />, otherwise nothing”.\nThe shortcuts are common, but you don’t have to use them if you prefer plain if.\nTry out some challenges\n1. Show an icon for incomplete items with ? :\n2. Show the item importa",
  "incomplete items with ? :\n2. Show the item importance with &&\n3. Refactor a series of ? : to if and variables\n\n\nChallenge 1 of 3: Show an icon for incomplete items with ? : \nUse the conditional operator (cond ? a : b) to render a ❌ if isPacked isn’t true.\n\n\nApp.js\nDownload\n\nReload\n\nClear\n\nFork\nfunction Item({ name, isPacked }) {\n  return (\n    <li className=\"item\">\n      {name} {isPacked && '✅'}\n    </li>\n  );\n}\n\nexport default function PackingList() {\n  return (\n    <section>\n      <h1>Sally Ri",
  "st() {\n  return (\n    <section>\n      <h1>Sally Ride's Packing List</h1>\n      <ul>\n        <Item \n          isPacked={true} \n          name=\"Space suit\" \n        />\n        <Item \n          isPacked={true} \n          name=\"Helmet with a golden leaf\" \n        />\n        <Item \n          isPacked={false} \n          name=\"Photo of Tam\" \n        />\n      </ul>\n    </section>\n  );\n}\n\n\n\nShow more\nShow solution\nNext Challenge\nPrevious\nPassing Props to a Component\nNext\nRendering Lists\nCopyright © Meta ",
  "a Component\nNext\nRendering Lists\nCopyright © Meta Platforms, Inc\nuwu?\nLearn React\nQuick Start\nInstallation\nDescribing the UI\nAdding Interactivity\nManaging State\nEscape Hatches\nAPI Reference\nReact APIs\nReact DOM APIs"
]